Documents/УстановкаУсловийПребывания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>УстановкаУсловийПребывания</Name>
			<Comment>Установка условий пребывания в стационаре</Comment>
			<BasedOn>
				<xr:Item>Document.ОбращениеВСтационар</xr:Item>
				<xr:Item>Document.БронированиеКойкоМеста</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.УсловияПребывания</xr:Item>
				<xr:Item>InformationRegister.омг_ТекущиеМедицинскиеКарты</xr:Item>
				<xr:Item>InformationRegister.СостояниеКойкоМеста</xr:Item>
				<xr:Item>InformationRegister.КлиентыСтационара</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДвиженияВСтационаре</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Палата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Палаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОбращения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОбращениеВСтационар</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прейскурант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Прейскуранты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Полис</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраховыеПолисы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КойкоМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КойкоМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>омг_МедицинскаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МедицинскиеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Номенклатура</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/УстановкаУсловийПребывания/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Заполняет в документе тарифы по виду палаты
//
// Параметры:
//  ДокументОбъект	 - ДокументОбъектУстановкаУсловийПребывания - заполняемый документ.
//
Процедура ЗаполнитьТарифыПоВидуПалаты(ДокументОбъект) Экспорт 
	
	ВидПалаты = ДокументОбъект.Палата.ВидПалаты;
	
	Если ЗначениеЗаполнено(ВидПалаты)
		И ЗначениеЗаполнено(ВидПалаты.Прейскурант)
	Тогда
		ДокументОбъект.Прейскурант = ВидПалаты.Прейскурант;
	Иначе
		ДокументОбъект.Прейскурант = УправлениеНастройками.ПолучитьПрейскурантФилиала(РаботаСДокументамиСервер.ФилиалДокумента(ДокументОбъект));
	КонецЕсли;
	
	СписокОсновныхУслуг = ВидПалаты.ОсновныеУслуги.Выгрузить();
	
	ДокументОбъект.Номенклатура.Очистить();
	
	Для Каждого СтрокаУслуг Из СписокОсновныхУслуг Цикл
		ЗаполнитьЗначенияСвойств(ДокументОбъект.Номенклатура.Добавить(),СтрокаУслуг);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
